app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    @friends = Friend.all

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "first_name" = ?, "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "aaa"], ["last_name", "aaa"], ["email", "aaaaa"], ["phone", "aaaaa"], ["twitter", "aaaaa"], ["updated_at", "2022-02-02 23:37:40.250015"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 3]]
---
  def delete
    @friend.delete

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_friend
      @friend = Friend.find(params[:id])